Rapporto Push Notification System
=====================================

Rapporto Push Notification System — это готовое IT-решение по организации сервиса отправки Push-уведомлений, позволяющее достичь высоких показателей процента доставки сообщений и предоставить широкий перечень возможностей по передаче дополнительного контента (аудио, видео, deeplink и т. д.). 

Система Rapporto Push Notification System обеспечивает выполнение следующих функций:

* ведение и актуализация регистрационной информации (устройства, токены, номера телефонов, подписки и пр.);        
* прием уведомлений, переданных заказчиком в транспортную систему;      
* осуществление отправки уведомлений конечным пользователям через облачные сервисы PNS (APNS, FCM, HMS, RuStore, PWA), которые обеспечивают доставку Push-уведомлений в приложения на устройства с различными операционными системами (iOS, Android, HarmonyOS);       
* получение статусов доставки уведомлений;
* возврат финальных статусов доставки уведомлений;
* хранение истории уведомлений.

Скачать :download:`Описание ПО Rapporto Push Notification System <doc/Описание сервиса RPNS_в.1.4.pdf>`

Скачать :download:`Установка и настройка ПО Rapporto Push Notification System <doc/Сервис RPNS. Инструкция по установке и настройке.pdf>`

Скачать :download:`Руководство администратора по эксплуатации ПО Rapporto Push Notification System <doc/RPNS Руководство администратора в.2.1.pdf>`

.. note:: Стоимость ПО "Rapporto Push Notification System" рассчитывается индивидуально в зависимости от технического задания заказчика. Запрос на предоставление стоимости ПО необходимо направить на электронную почту по адресу: info@rapporto.ru.
